<a href="https://colab.research.google.com/github/ankiboyz/SQL/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This repository is all about questions on SQL.


---

Author: Ankur Saxena

You Tube: Linked In: Facebook Group:

#Code of Honor:
Please look into the solution only once you have attempted the question at your end.
These questions are amalgamation of innumerous hours of self practice put into becoming a great data scientist.The idea here is to share with you the same to help in your journey to greatness; kindly do give these an honest try and look for various ways in which the solution can be made more efficient (query performance at the same time sufficing the functional requirement).

# Section - Introductory Queries

## Q1.Find all the titles of the movies as "Title" in upper case and concatenate the title with the respective tagline of the movie separated by a hyphen(-) for the Top 10 highest revenue movies. 
Return the column as 'Title'.
Note: For example, the 'Title' should be displayed as 'JURASSIC WORLD-THE PARK IS OPEN.'

###Solution(Way#1) : We can simply use the Concatenation to concat the various columns as output as one string.

####SQL query as follows

```
SELECT CONCAT(UPPER(original_title),'-',UPPER(tagline)) AS Title FROM movies 
ORDER BY revenue DESC LIMIT 10
```

##Q2. Find all the titles of the movies directed by 'Noah Baumbach' from the given movies dataset.
Return the column 'original_title '.

### Solution: A simple query with a where clause

#### SQL Query as follows:


```
SELECT original_title FROM movies WHERE director = 'Noah Baumbach'
```

##Q3. Find all the movie titles and their cast that belongs to the 'Comedy' genre using the movies table.

Return the column 'original_title' , 'cast'.

### Solution: Basically use the WHERE clause.

#### The Query is as follows:


```
SELECT original_title ,cast FROM movies 
WHERE genres IN ('Comedy')
```

## Q4. Calculate the weighted average rating from the columns vote count and vote average and save the column as 'Weighted_avg_rating' and display the top 10 movies and their rating up to two decimals based on the new column created.

Note: Use the given formula to calculate a weighted average rating (v/(v+m) * R) + (m/(m+v) * C )

Where,

v is the number of votes for the movie vote_count;

m is the minimum votes required, take m as 104.0;

R is the average rating of the movie vote_average;

C is the mean vote across the whole report take c as 5.97.

Return the columns 'original_title' , 'Weighted_avg_rating'

### Solution: Basically put up the formula and return the field as the alias.

#### The query is as follows.


```
SELECT original_title, 
ROUND((vote_count/(vote_count+104.0)* vote_average) + (104.0/(104.0+vote_count)*5.97),2) AS Weighted_avg_rating
FROM movies 
ORDER BY Weighted_avg_rating desc
-- ORDER BY Weighted_avg_rating
LIMIT 10
```

## Q5. Find the movie titles, taglines, and directors for the top 5 popular movies.

Return the columns 'original_title', 'tagline', and 'director'.

### Solution: Here we order by the DESC order of Popularity and then take the Top 5

#### The Query is as follows:


```
SELECT original_title ,tagline ,director FROM movies
ORDER BY popularity DESC LIMIT 5
```

# Section - Filtering and Subqueries

## Q1. Show the titles of the movies that are released after 2014 and have an average vote rating greater than 7.

Return the column 'original_title'

### Solution: Here, we have to filter out with two filters those are being applied.

#### The Query is as follows:

```
SELECT original_title FROM movies WHERE
release_year > 2014 AND vote_average > 7
```

##Q2. List down all the movies along with their details that have keywords like 'sport' or 'sequel' or 'suspense'.

Return the columns 'original_title', 'director', 'genres', 'cast', 'budget', 'revenue', 'runtime', and 'vote_average'.

### Solution: Based on how the keywords field is storing the data , like it can store comma separated values of keywords , it can also be such that its storing only one keyword at a time , it can also store keywords like 'sporting', 'suspenseful' etc. Based on the data that is stored in keywords it can be of few of the many options as listed below.

#### Query is as follows:

```
select original_title, director, genres, cast, budget, revenue, runtime, vote_average 
from movies 
where keywords ='sport' or 
keywords ='sequel' or 
keywords ='suspense'
```
OR 

```
select original_title, director, genres, cast, budget, revenue, runtime, vote_average 
from movies 
where keywords in ('sport', 'sequel', 'suspense');
```

## Q3. Display all the details of the employees who did not work at any job in the past.

Return all the columns from the employee's table.

### Solution: There are couple of options to achieve this are listed below.

#### Query is as follows:

This is the sub query way.
```
SELECT * FROM employees 
WHERE employee_id NOT IN (select distinct employee_id from job_history )  
```

This is the Join way:

```
SELECT emp.*
FROM 
	employees emp LEFT JOIN job_history hist
    ON emp.employee_id = hist.employee_id
WHERE
	hist.employee_id IS NULL;
```

## Q4. Find the details of employees who are not working in any department.

Return the columns 'employee_id','first_name', 'last_name','job_id', and 'manager_id'.

### Solution: For queries like this we need to be very much aware of all the possible values those can be entered in the Department field. It could have one empty space as a  value, series of empty spaces as value, NULL as value , or in some cases as per the convention followed could have 0 as the value denoting NO depratment. Here it can have NULL or empty spaces, so in this light we need to handle this as follows.

####Query is as follows:


```
select employee_id,first_name, last_name,job_id, manager_id
from employees where ((department_id IS NULL) OR (trim(department_id) = ''))
```

##Q5. Find the employee's details who work in the same job as the employee with employee_id as 107.

Return the columns 'full_name', 'salary', 'department_id', 'job_id'.

### Solution: Here we need to use the subquery to find out the job_id of 107 employee and return the needed details.

#### Query is as follows:

This is the subquery way:


```
select concat(first_name,' ', last_name) as full_name, salary,department_id, job_id from employees 
where job_id = (select job_id from employees where employee_id = 107)
```

##Q6. Display the details of the movies which belong to the 'Horror' genre in descending order of popularity.

Return the columns 'original_title', 'popularity'.

### Solution: This can be done by Filtering the results and then ordering the results as per needed.

#### Query is as follows:

```
SELECT original_title ,popularity FROM movies WHERE
genres IN ('Horror') ORDER BY popularity DESC
```

##Q7. Find the details of the movies that are released between the years 2012-2015 i.e, (Including 2012 and 2015).

Return the columns 'original_title', 'genres', 'vote_average', and 'revenue'.

### Solution: Here in we need to apply the filter with between operator. The between operator includes the 'starting from' value and also the 'end to' value of the range.

#### Query is as follows:


```
select original_title,genres,vote_average,revenue from movies where release_year 
between 2012 and 2015
```
OR


```
select original_title,genres,vote_average,revenue from movies where release_year >=2012 AND release_year <= 2015

```

##Q8. Write a query to display the employee details who report to Adam. The reporting structure can be inferred from the manager_id column in the employee's table.

Return the columns 'employee_id', 'full_name'(first name and last name separated by space), 'salary'.

### Solution: Herein, all the employees reporting to first name as 'Adam' are to be reported. Now based on the way data in first name column is stored , like it can be stored as 'ADAM', 'adam', 'Adam', or any combo of upper and lower case.So based on the way it is stored caution needs be taken.

#### Query is as follows:



```
select employee_id, concat(first_name, ' ', last_name) as full_name, salary
from employees where manager_id IN (select employee_id from employees where first_name like '%Adam%' )
```
OR

```
select employee_id, concat(first_name, ' ', last_name) as full_name, salary
from employees where manager_id IN (select employee_id from employees where upper(first_name) = 'ADAM' )
```

##Q9. Display the details of the employees who work in the departments 50,10, or 80 and their salary is between 5000 to 10000 and also where employees have no commission_pct(commission percentage).

Return the columns 'employee_id', 'first_name', 'last_name', 'salary'.

### Solution: This is majorly the application of the filter.

#### Query is as below:


```
select employee_id, first_name, last_name, salary from employees 
where department_id IN (10,50,80) and salary between 5000 and 10000
and commission_pct is NULL
```

##Q10.Find the details of the employees who are working in the departments 'Administration', 'Marketing', and 'Human Resources'.

Return the columns 'employee_id', 'full_name'(first and last name separated by space), and 'salary'.

### Solution: This is also testing the application of filter , wherein the to be filtered conditions is based on value from anotehr table.

####Query is as follows:

```
select employee_id, concat(first_name,' ', last_name) as full_name, salary
from employees where department_id IN (select department_id from departments 
where department_name IN ('Administration','Marketing','Human Resources') )
```

##Q11. Find all the employees whose first name ends with the letter 'n'.

Return the columns 'employee_id', 'full_name' (first name and last name separated by space), and 'phone_number'.

### Solution: This basically requires the understanding of the wild card characters.

#### Query is as follows:


```
select employee_id, concat(first_name, ' ', last_name) as full_name, phone_number
from employees where first_name like '%n'
```

## Q12. Display the details of all the employees whose department location is in Seattle.

Return the columns 'first_name', 'last_name', 'employee_id', and job_id'.

###Solution: This is basically way to get the to be filtered value hoping a coule of tables.

#### Query is as follows:


```
SELECT first_name, last_name, employee_id, job_id
FROM employees 
Where department_id IN 
(SELECT department_id from departments 
where location_id IN
(SELECT location_id from locations where
city = 'Seattle')
)
```